Repository: ukwa/ukwa-pywb
Catalog: i18n/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: Live On
cy: Yn fyw

source: Calendar icon
cy: Eicon calendr

source: Back to Calendar
cy: Dychwelyd i'r Calendr

source: Language:
cy: Iaith:

source: Loading...
cy: Llwytho ...

source: UK Web Archive Logo
cy: Logo Archif We y DG

source: Available via Custom Viewer
cy: Ar gael trwy Custom Viewer

source: Click <a href="npld-viewer:/%(uri)s">here</a> to load this page in a custom viewer.
cy: Cliciwch <a href="npld-viewer:/%(uri)s">yma</a> i lwytho'r dudalen hon mewn syllwr personol

source: Available in Legal Deposit Library Reading Rooms only
cy: Ar gael yn unig yn Ystafelloedd Darllen y Llyfrgelloedd Adnau Cyfreithiol

source: This Legal Deposit resource can only be accessed on site in a Legal Deposit Library reading room.
cy: Mae'r mynediad i'r adnodd Adnau Cyfreithiol hwn ar gael yn unig yn Ystafell Ddarllen Llyfrgell Adnau Cyfreithiol.

source: Next steps
cy: Camau nesaf

source: If you are in a Legal Deposit Library Reading Room, you should be able to access this resource using a library computer, via the appropriate secure access gateway:
cy: Os ydych mewn Ystafell Ddarllen Llyfrgell Adnau Cyfreithiol, dylech allu defnyddio'r adnodd hwn gan ddefnyddio cyfrifiadur llyfrgell, trwy'r porth mynediad diogel priodol:

source: via the British Library's Secure Gateway
cy: trwy borth diogel y Llyfrgell Brydeinig

source: via the National Library of Wales' Secure Gateway
cy: trwy borth diogel Llyfrgell Genedlaethol Cymru

source: via the National Library of Scotland's Secure Gateway
cy: trwy borth diogel Llyfrgell Genedlaethol yr Alban

source: via the Cambridge University Library's Secure Gateway
cy: trwy borth diogel Llyfrgell Prifysgol Caergrawnt

source: via the Trinity College Library's Secure Gateway
cy: trwy borth diogel y Llyfrgell Coleg y Drindod, Dulyn

source: via the Bodleian Libraries' Secure Gateway
cy: trwy borth diogel y Llyfrgell y Bodleian

source: You may also wish to try:
cy: Gellir hefyd edrych ar hwn:

source: Visiting the current, live site
cy: Ymweld â safle byw a chyfredol

source: Seeing if other web archives hold copies of this URL
cy: Edrych os oes copïau o'r Url hwn gyda archifoedd y we eraill

source: Page Locked
cy: Tudalen ar Glo

source: The page you have requested is currently in use. Please try again later.
cy: Ni chaniateir mynediad i'r adnodd hwn ar hyn o bryd. Ceisiwch rhywbryd eto.

source: You are using a browser that is out of date and is not supported for this site. Certain portions of this site may not work correctly. Please try to upgrade or use another browser.
cy: Nid adabyddwyd eich porwr gan eich safle hwn oherwydd ei fod yn hen. Bydd adrannau o'r wefan dim yn gweithio. Diweddarwch neu ddefnyddiwch borwr arall.

source: UK Web Archive logo
cy: Logo Archif We y DG

source: Language select
cy: Dewis iaith

source: UK Web Archive Access System
cy: System fynediad Archif We y DG

source: This web archive contains the following collections:
cy: Mae'r archif we hon yn cynnwys y casgliadau canlynol:

source: Non-Print (Electronic) Legal Deposit Access Policy
cy: Polisi Mynediad Adnau Cyfreithiol Di-brint (Electronig).

source: I agree to the terms and conditions of this policy
cy: Cytunnaf i delerau ac amodau'r polisi hwn

source: Continue
cy: Parhau
